# Brewfile
# Install with: brew bundle --file=brew/Brewfile

# ==============================================================================
# Taps
# ==============================================================================
tap "gromgit/brewtils"

# ==============================================================================
# CLI Tools (Formulae)
# ==============================================================================
brew "node"              # JavaScript runtime
brew "go"                # Go programming language
brew "zoxide"            # Smarter cd command
brew "eza"               # Modern ls replacement
brew "bat"               # Cat with syntax highlighting
brew "podman"            # Container runtime (Docker alternative)
brew "kubernetes-cli"    # kubectl
brew "git-delta"         # Better git diff viewer
brew "diff-so-fancy"     # Good-looking diffs for git
brew "jq"                # JSON processor
brew "fx"                # Terminal JSON viewer
brew "wget"              # File retriever
brew "age"               # File encryption tool
brew "llmfit"            # Find what models run on your hardware
brew "mactop"            # Apple Silicon monitor top
brew "chafa"             # Terminal image/graphics renderer
brew "csvlens"           # Terminal CSV viewer
brew "taproom"           # Interactive TUI for Homebrew
brew "glow"              # Terminal Markdown renderer
brew "googleworkspace-cli" # Google Workspace CLI (Drive, Gmail, Calendar, etc.)
brew "1password-cli"     # 1Password CLI (op) for secrets and font decryption
cask "font-fira-code-nerd-font"      # Fira Code with Nerd Font icons (for eza, etc.)
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono with Nerd Font icons
