# Brewfile
# Install with: brew bundle --file=brew/Brewfile

# ==============================================================================
# Taps
# ==============================================================================
# (none required for current packages)

# ==============================================================================
# CLI Tools (Formulae)
# ==============================================================================
brew "node"              # JavaScript runtime
brew "go"                # Go programming language
brew "zoxide"            # Smarter cd command
brew "eza"               # Modern ls replacement
brew "bat"               # Cat with syntax highlighting
brew "podman"            # Container runtime (Docker alternative)
brew "kubernetes-cli"    # kubectl
brew "git-delta"         # Better git diff viewer
brew "diff-so-fancy"     # Good-looking diffs for git
brew "jq"                # JSON processor
brew "fx"                # Terminal JSON viewer
brew "wget"              # File retriever

# ==============================================================================
# Desktop Apps (Casks)
# ==============================================================================
# Browsers
cask "google-chrome"
cask "firefox@nightly"

# Productivity
cask "notion"
cask "notion-calendar"
cask "linear-linear"
cask "rectangle"
cask "stay"

# Communication
cask "slack"
cask "discord"
cask "whatsapp"
cask "zoom"

# Development
cask "ghostty"
cask "iterm2"
cask "docker-desktop"
cask "claude"
cask "antigravity"

# Design
cask "figma"

# Other/Utilities
cask "granola"
cask "1password"
cask "clocker"           # Menu bar timezone tracker
