aaron-bond.better-comments
anysphere.cursorpyright
batisteo.vscode-django
bradlc.vscode-tailwindcss
bungcip.better-toml
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
emeraldwalk.runonsave
esbenp.prettier-vscode
formulahendry.auto-close-tag
github.github-vscode-theme
golang.go
jaakko.black
jgclark.vscode-todo-highlight
kevinrose.vsc-python-indent
llvm-vs-code-extensions.vscode-clangd
meta.pyrefly
miguelsolorio.fluent-icons
mohsen1.prettify-json
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
njpwerner.autodocstring
redhat.java
redhat.vscode-commons
redhat.vscode-yaml
rust-lang.rust-analyzer
sashaweiss.bracket-jumper
shopify.ruby-lsp
steoates.autoimport
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wholroyd.jinja
